/*************************************************************************
	> File Name: 1.2.cpp
	> Author: 少年宇
	> Mail: 
	> Created Time: 2019年12月15日 星期日 14时57分28秒
 ************************************************************************/

//时间复杂度O(1)
#include <stdio.h>
#include <stdlib.h>

//996 
//995 990 985 980
int main() {
    int sum1 = (3 + 999) * 333 / 2;
    int sum2 = (5 + 995) * (995 / 5) / 2;
    int sum3 = (15 + (999 / 15) * 15) * (990 / 15) / 2;
    printf("sum = %d\n", sum1 + sum2 - sum3);
    return 0;
}
